In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [85]:
'''A Series is a one-dimensional array-like object containing an array of data (of any
NumPy data type) and an associated array of data labels, called its index'''

'A Series is a one-dimensional array-like object containing an array of data (of any\nNumPy data type) and an associated array of data labels, called its index'

In [86]:
obj=Series(["a","b","c"])

In [87]:
obj

0    a
1    b
2    c
dtype: object

In [88]:
'''to get the obj values and index we can use'''
obj.index

Int64Index([0, 1, 2], dtype='int64')

In [89]:
 obj.values  #notice the dtype of the values ,,if they were interger it would be int

array(['a', 'b', 'c'], dtype=object)

In [90]:
new_obj=Series([1,2,3,4],index=list("dace"))

In [91]:
new_obj

d    1
a    2
c    3
e    4
dtype: int64

In [92]:
#compared to the regular numpy array u can use the index name to access the values
new_obj["e"]

4

In [93]:
np.mean(new_obj)

2.5

In [94]:
#and other things can also be done
new_obj(new_obj>1) #See this wont work

TypeError: 'Series' object is not callable

In [95]:
new_obj[new_obj%2==0]

a    2
e    4
dtype: int64

In [96]:
#or 
new_obj[new_obj.values%2==0]

a    2
e    4
dtype: int64

In [97]:
new_obj*2

d    2
a    4
c    6
e    8
dtype: int64

In [98]:
#onther way to think of obj is a dict
#where index is the key
"d" in new_obj

True

In [99]:
"f" in new_obj

False

In [100]:
1 in new_obj

False

In [101]:
#if we have data in a dict we can use it 
di={"ranchi":40,"patna":45,"karra":38,"jmdpr":45}
temperatur=Series(di)

In [102]:
temperatur

jmdpr     45
karra     38
patna     45
ranchi    40
dtype: int64

In [103]:
#when only passing the indexes
states=["tamad","ranchi","patna","karra","jmdpr"]
new_temperature=Series(di,index=states)

In [104]:
new_temperature

tamad    NaN
ranchi    40
patna     45
karra     38
jmdpr     45
dtype: float64

In [105]:
#isnull and notnull should be used to detect the missing values
new_temperature.isnull()

tamad      True
ranchi    False
patna     False
karra     False
jmdpr     False
dtype: bool

In [106]:
if new_temperature.isnull:
    print new_temperature[new_temperature.isnull().values]

tamad   NaN
dtype: float64

In [107]:
temperatur+new_temperature

jmdpr     90
karra     76
patna     90
ranchi    80
tamad    NaN
dtype: float64

In [108]:
#both the series and the index has name attribute
temperatur.name="just data"

In [109]:
temperatur.index.name="cities"

In [110]:
temperatur

cities
jmdpr     45
karra     38
patna     45
ranchi    40
Name: just data, dtype: int64

In [111]:
temperatur.index=["rnc","jmdpr","ptn","kar"] #we can change the name of the indexes like this

In [112]:
temperatur

rnc      45
jmdpr    38
ptn      45
kar      40
Name: just data, dtype: int64

In [113]:
#starting data frame
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [114]:
df=DataFrame(data)
#in order to see the columns in a specified sequence

In [115]:
DataFrame(df,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [116]:
#to access the columsn
df.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [117]:
df["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
Name: state, dtype: object

In [118]:
#rows can be accessed using the ix indexing field
df.ix[1]

pop       1.7
state    Ohio
year     2001
Name: 1, dtype: object

In [119]:
new_df=DataFrame(df,columns=["state","pop","year","ratio"])

In [120]:
new_df

    state  pop  year  ratio
0    Ohio  1.5  2000    NaN
1    Ohio  1.7  2001    NaN
2    Ohio  3.6  2002    NaN
3  Nevada  2.4  2001    NaN
4  Nevada  2.9  2002    NaN

In [121]:
#now the ratio column can be changed by
new_df.ratio='missing'

In [122]:
li=[]

for i in range(len(df)):
    li.append(i)
df.ratio=li

#either this method or

In [123]:
df.ratio=np.arange(5,10)

In [124]:
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [125]:
#assigning a column that doesnot exist add new columns

In [126]:
#we can give columns and indexes name
df.index.name="serial no."
df.columns.name="attrib"
df.name="data"

In [127]:
df

attrib      pop   state  year
serial no.
0           1.5    Ohio  2000
1           1.7    Ohio  2001
2           3.6    Ohio  2002
3           2.4  Nevada  2001
4           2.9  Nevada  2002

In [128]:
#.values return data in a 2d frame
df.values[1][2]

2001L

In [129]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [130]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
df=DataFrame(data)

In [131]:
df.index

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [132]:
df.index.append(np.arange(5,7))

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [133]:
df.index.isin([1,5,79,2,3])

array([False,  True,  True,  True, False], dtype=bool)

In [134]:
df.index=[list("abcde")]

In [135]:
df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2001
c  3.6    Ohio  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002

In [136]:
#RE-INDEXING

In [137]:
#reindexing is used to make new objects that have different indexes 
ser=Series(list("abcdef"),index=np.arange(8,14))

In [138]:
ser

8     a
9     b
10    c
11    d
12    e
13    f
dtype: object

In [139]:
new_ser=ser.reindex(np.arange(6,12),fill_value=0) #notice the fill value method

In [140]:
new_ser.fillna="not found"
new_ser

6     0
7     0
8     a
9     b
10    c
11    d
dtype: object

In [141]:
#here while reindexing we also have the option of forward and backword filling by Method attribute
onemore_ser=ser.reindex(index=np.arange(5,11))

In [142]:
onemore_ser.reindex(range(8,14),method="ffill")

8     a
9     b
10    c
11    c
12    c
13    c
dtype: object

In [143]:
df

   pop   state  year
a  1.5    Ohio  2000
b  1.7    Ohio  2001
c  3.6    Ohio  2002
d  2.4  Nevada  2001
e  2.9  Nevada  2002

In [144]:
new_df=df.reindex(list("acdbf"),method="ffill")

In [145]:
new_df

   pop   state  year
a  1.5    Ohio  2000
c  3.6    Ohio  2002
d  2.4  Nevada  2001
b  1.7    Ohio  2001
f  2.9  Nevada  2002

In [146]:
#dropping entries from the frame
new_df.drop("c")

   pop   state  year
a  1.5    Ohio  2000
d  2.4  Nevada  2001
b  1.7    Ohio  2001
f  2.9  Nevada  2002

In [147]:
new_df #see that df still exists with c because its a view

   pop   state  year
a  1.5    Ohio  2000
c  3.6    Ohio  2002
d  2.4  Nevada  2001
b  1.7    Ohio  2001
f  2.9  Nevada  2002

In [148]:
new_df.drop("pop",axis=1) #remember to give axis

    state  year
a    Ohio  2000
c    Ohio  2002
d  Nevada  2001
b    Ohio  2001
f  Nevada  2002

In [149]:
new_df #so there is no method to drop a particular element from the table

   pop   state  year
a  1.5    Ohio  2000
c  3.6    Ohio  2002
d  2.4  Nevada  2001
b  1.7    Ohio  2001
f  2.9  Nevada  2002

In [150]:
data = DataFrame(np.arange(16).reshape((4, 4)),
     index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])

In [151]:
data #INDEXING -->IS FOR RETRIVING COLUMNS (ONE OR MORE) ##################################################################

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [152]:
#INDEXING see its giving one column
data["one"]

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [153]:
data[1] #this doesnot works

KeyError: 1

In [ ]:
#but
data[:0] #or this data[:0] or data[0:2]

In [154]:
data[["one","two"]]

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [155]:
data[1:3] #so remeber when you give column names instead of number columns are shown in the output but reverse is the case for numberes

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11

In [156]:
data[data["three"]>5] #this means not show the row having data in "three" less than 6

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [157]:



#For DataFrame label-indexing on the rows, I introduce the special indexing field ix. It
#enables you to select a subset of the rows and columns from a DataFrame with NumPylike
#notation plus axis labels

In [158]:
data.ix["Colorado",]

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [159]:
data.ix["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [160]:
data.ix[["Colorado","Utah"],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [161]:
data.ix[:,"one"]

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [162]:
data.icol(2)
#this selects single col based on the integer given if we dont know the name of the column

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [163]:
data["three"]

Ohio         2
Colorado     6
Utah        10
New York    14
Name: three, dtype: int32

In [164]:
data.get_value("Utah","two",) #so inocontrast to what we wrote above this is the method to get a single value from all the values

9

In [165]:
###############################################################################################################################

In [166]:
########################################################################################################################

In [167]:
#ARITHMETIC AND DATA ALIGNMENT

In [168]:
d1=DataFrame(np.arange(12).reshape(3,4),columns=list("abcd"))
d2=DataFrame(np.arange(20).reshape(4,5),columns=list("abcde"))

In [169]:
add_d=d1+d2
add_d #notice that we have values in e columns and 4th(3) row ,

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [170]:
#or in order to fill the missing values we can do this
d1.add(d2,fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [171]:
#in the same manner we can also fill while reindexing
d1.reindex(columns=d2.columns)

   a  b   c   d   e
0  0  1   2   3 NaN
1  4  5   6   7 NaN
2  8  9  10  11 NaN

In [172]:
d1.reindex(columns=d2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [173]:
#############################################################################################################################

In [174]:
#FUNCTION APPLICATION AND MAPPING

In [175]:
#WE KNOW THAT nUMPY THINGS WORK FINE ON THE DATAFRAMES
np.mean(d1) #etc

a    4
b    5
c    6
d    7
dtype: float64

In [176]:
#one more method to apply functions is apply
f=lambda x:x.mean()
d1.apply(f) #same

a    4
b    5
c    6
d    7
dtype: float64

In [177]:
f=lambda x: x%2==0
d1.apply(f) #because this is boolean

      a      b     c      d
0  True  False  True  False
1  True  False  True  False
2  True  False  True  False

In [178]:
format = lambda x: '%.2f' % x
d1.apply(format) #see this wont work

TypeError: ('float argument required, not Series', u'occurred at index a')

In [179]:
#but 
d1.applymap(format)

      a     b      c      d
0  0.00  1.00   2.00   3.00
1  4.00  5.00   6.00   7.00
2  8.00  9.00  10.00  11.00

In [180]:
#in order to apply map only to a particular column
d1["c"].apply(format)

0     2.00
1     6.00
2    10.00
Name: c, dtype: object

In [181]:
#okay so till here we are done

In [182]:
#SORTING AND RANKING

In [191]:
just_Data=DataFrame(np.random.randint(5,100,10).reshape(5,2),columns=list("ab"))

In [196]:
just_Data.sort_index(by="a") #this is the method by which we can sort by value

    a   b
3   5  92
2  13  96
1  58  57
0  68  86
4  81  29

In [205]:
just_Data[["b","a"]].sort_index(axis=1) #bakwas just to show that sort_index(axis=1) sort the columns
#also sort_index(ascending=False) sorts in descending order

    a   b
0  68  86
1  58  57
2  13  96
3   5  92
4  81  29

In [206]:
######################
#rank method ranks the list from lowest to highest
just_Data.rank()
#see in the column a 5 is the lowest and 81 is the highest and how it is ranked

   a  b
0  4  3
1  3  2
2  2  5
3  1  4
4  5  1

In [207]:
just_Data.describe()

               a          b
count   5.000000   5.000000
mean   45.000000  72.000000
std    33.977934  28.486839
min     5.000000  29.000000
25%    13.000000  57.000000
50%    58.000000  86.000000
75%    68.000000  92.000000
max    81.000000  96.000000

In [208]:
#like this there are other statistical methods also
#idmax and idmin gives the index values of the min and max element

In [219]:
#value_counts only work with data that is one dimensional
pd.value_counts(just_Data.values) #won't work

Exception: Data must be 1-dimensional

In [221]:
#in order to count the values we can do
just_Data.apply(pd.value_counts) #we can apply the fillna method here to cover the NAN values

     a   b
5    1 NaN
13   1 NaN
29 NaN   1
57 NaN   1
58   1 NaN
68   1 NaN
81   1 NaN
86 NaN   1
92 NaN   1
96 NaN   1

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [2]:
just_Data=DataFrame(np.random.randint(5,100,10).reshape(5,2),columns=list("ab"))

In [3]:
just_Data.isin([13]) #is in shows if the value is in the data frame

       a      b
0  False  False
1  False  False
2  False   True
3  False  False
4  False  False

In [4]:
just_Data[just_Data.isin([13,23])] # gives out the index...

    a   b
0 NaN NaN
1 NaN NaN
2 NaN  13
3 NaN NaN
4 NaN NaN

In [5]:
###################################################################################################################
#HANDLING MISSING DATA

In [6]:
#THE METHODS ARE..fillna,dropna,isnull,notnull

In [7]:
just_Data[just_Data.isin([13,23])].dropna(how="all") #how="all" will drop the rows having all the elements NaN

    a   b
2 NaN  13

In [8]:
#can use axis attrib in dropna() to drop columns with all the elements having NaN

In [9]:
#using fillna to fill the values
just_Data[just_Data.isin([13,23])].fillna(0)

   a   b
0  0   0
1  0   0
2  0  13
3  0   0
4  0   0

In [10]:
#or
just_Data[just_Data.isin([13,23])].fillna(method="ffill")

    a   b
0 NaN NaN
1 NaN NaN
2 NaN  13
3 NaN  13
4 NaN  13

In [11]:
#or 
just_Data[just_Data.isin([13,23])].fillna({"a":"this","b":"that"})

      a     b
0  this  that
1  this  that
2  this    13
3  this  that
4  this  that

In [12]:
##############################################################################################################################

In [13]:
#HIERARCHICHAL INDEXING

In [14]:
#HIERARCHICHAL INDEXING IS THE MOST IMPORTANT FEATURE OF THT PANDAS LIBRARY
data = Series(np.random.randn(10), index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [15]:
data

a  1    0.244299
   2    0.647981
   3   -0.002767
b  1    0.736268
   2   -0.481697
   3   -0.748784
c  1   -0.069739
   2    1.430919
d  2   -1.247396
   3    1.259855
dtype: float64

In [16]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [17]:
data.ix[3] #see this is the method  of selecting an element

0.73626849753417356

In [18]:
data["b"]

1    0.736268
2   -0.481697
3   -0.748784
dtype: float64

In [19]:
data["b":"c"] #that means frm b to c..below is for b and d

b  1    0.736268
   2   -0.481697
   3   -0.748784
c  1   -0.069739
   2    1.430919
dtype: float64

In [20]:
data.ix[["b","d"]] #this for b nd d

b  1    0.736268
   2   -0.481697
   3   -0.748784
d  2   -1.247396
   3    1.259855
dtype: float64

In [21]:
data[:][2] #this means among all give 2

-0.0027668201500098792

In [22]:
data[:,2] #this means give 2 of all

a    0.647981
b   -0.481697
c    1.430919
d   -1.247396
dtype: float64

In [23]:
data.unstack()

          1         2         3
a  0.244299  0.647981 -0.002767
b  0.736268 -0.481697 -0.748784
c -0.069739  1.430919       NaN
d       NaN -1.247396  1.259855

In [24]:
data.unstack().stack()

a  1    0.244299
   2    0.647981
   3   -0.002767
b  1    0.736268
   2   -0.481697
   3   -0.748784
c  1   -0.069739
   2    1.430919
d  2   -1.247396
   3    1.259855
dtype: float64

In [25]:
data.index.names=["alpha","numeric"]
data

alpha  numeric
a      1          0.244299
       2          0.647981
       3         -0.002767
b      1          0.736268
       2         -0.481697
       3         -0.748784
c      1         -0.069739
       2          1.430919
d      2         -1.247396
       3          1.259855
dtype: float64

In [26]:
data.swaplevel("alpha","numeric")

numeric  alpha
1        a        0.244299
2        a        0.647981
3        a       -0.002767
1        b        0.736268
2        b       -0.481697
3        b       -0.748784
1        c       -0.069739
2        c        1.430919
         d       -1.247396
3        d        1.259855
dtype: float64

In [27]:
#we can also use swapaxes here

In [28]:
#do sortlevel and swaplevel.sortlevel together

In [29]:
frame = DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [30]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [31]:
frame["Ohio","Green"]["a"]

1    0
2    3
Name: (Ohio, Green), dtype: int32

In [32]:
frame.index.names=["key1alpha","key2nume"]

In [33]:
frame.swaplevel("key1alpha","key2nume")

                    Ohio     Colorado
                   Green Red    Green
key2nume key1alpha
1        a             0   1        2
2        a             3   4        5
1        b             6   7        8
2        b             9  10       11

In [35]:
frame.sortlevel(axis=1)

                   Colorado  Ohio
                      Green Green Red
key1alpha key2nume
a         1               2     0   1
          2               5     3   4
b         1               8     6   7
          2              11     9  10

In [37]:
######################################################################################################################
#summary statistics by level
frame.sum(level="key2nume")

          Ohio     Colorado
         Green Red    Green
key2nume
1            6   8       10
2           12  14       16